Revit 2015 API
TableSectionData.SetCellText Method
 Sets a cell's text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public void SetCellText(
	int nRow,
	int nCol,
	string text
)
Visual Basic
Public Sub SetCellText ( _
	nRow As Integer, _
	nCol As Integer, _
	text As String _
)
Visual C++
public:
void SetCellText(
	int nRow,
	int nCol,
	String^ text
)
Parameters
nRow
Type: System.Int32
nCol
Type: System.Int32
text
Type: System.String
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace